notes/talks/raku_new_year/b-raku_features.org
* What's good about Raku?
** saner numerics built-in
*** big integers 
*** rational numbers
****  reduce chances of floating-point weirdness
** custom parsing via grammars and regexs
*** regexps redesigned and cleaned up
*** flexible pattern decomposition via grammars
**** better than perl's interpolated qrs
*** raku uses these grammars to parse itself: they *have* to work well
** built-in object system
*** makes easy things easy
*** style similar to moose/moo
*** raku's design uses this extensively: "objects all the way down"
**** again: these *have* to perform well
** built-in type system
*** strong typing is possible (though optional)
*** very useful for multidispatch
