notes/talks/raku_new_year/b-raku_features.md
- [What's good about Raku?](#orgb6fa0d2)
  - [saner numerics built-in](#orgdc62ef1)
    - [big integers](#org5363666)
    - [rational numbers](#orgf882ca1)
  - [custom parsing via grammars and regexs](#orge6d291e)
    - [regexps redesigned and cleaned up](#org87daffb)
    - [flexible pattern decomposition via grammars](#orgc7b82b3)
    - [raku uses these grammars to parse itself: they **have** to work well](#org8820282)
  - [built-in object system](#org507abef)
    - [makes easy things easy](#orgeb90e4e)
    - [style similar to moose/moo](#orgfbb307e)
    - [raku's design uses this extensively: "objects all the way down"](#orgaaf9af9)
  - [built-in type system](#org989ff8a)
    - [strong typing is possible (though optional)](#org99e62ec)
    - [very useful for multidispatch](#orge9b4dce)


<a id="orgb6fa0d2"></a>

# What's good about Raku?


<a id="orgdc62ef1"></a>

## saner numerics built-in


<a id="org5363666"></a>

### big integers


<a id="orgf882ca1"></a>

### rational numbers

1.  reduce chances of floating-point weirdness


<a id="orge6d291e"></a>

## custom parsing via grammars and regexs


<a id="org87daffb"></a>

### regexps redesigned and cleaned up


<a id="orgc7b82b3"></a>

### flexible pattern decomposition via grammars

1.  better than perl's interpolated qrs


<a id="org8820282"></a>

### raku uses these grammars to parse itself: they **have** to work well


<a id="org507abef"></a>

## built-in object system


<a id="orgeb90e4e"></a>

### makes easy things easy


<a id="orgfbb307e"></a>

### style similar to moose/moo


<a id="orgaaf9af9"></a>

### raku's design uses this extensively: "objects all the way down"

1.  again: these **have** to perform well


<a id="org989ff8a"></a>

## built-in type system


<a id="org99e62ec"></a>

### strong typing is possible (though optional)


<a id="orge9b4dce"></a>

### very useful for multidispatch
